# Exploratory Data Analysis

### Importing the libraries

In [18]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [19]:
# reading the dataset 
df = pd.read_excel('Banana Fabric_data.xlsx')
df_dummy = df
df

,company Name,Amount,Old Price,offer %,product type,Pack_Units,product link,rating status,ratings,color,location
0,doctor towels,1299.0,1599.0,18.761726,Banana Double Cloth Bath Towels,1,https://doctortowels.com/products/banana-doubl...,Good,4.5,Golden Ochre,"coimbatore ,tamil nadu"
1,doctor towels,1399.0,1599.0,12.507817,Banana Jacquard Floral Bath Towel,1,https://doctortowels.com/products/buy-banana-j...,Good,4.5,Coral,"coimbatore ,tamil nadu"
2,doctor towels,989.0,1099.0,10.009099,Banana Jacquard Floral Hand Towel,2,https://doctortowels.com/products/banana-jacqu...,Medium,3.0,Chalk Blue,"coimbatore ,tamil nadu"
3,doctor towels,989.0,1099.0,10.009099,Banana Jacquard Floral Face Towel,4,https://doctortowels.com/products/banana-jacqu...,Medium,3.0,Pastel Green,"coimbatore ,tamil nadu"
4,doctor towels,599.0,849.0,29.446408,Banana Jacquard Floral Hair Towel,1,https://doctortowels.com/products/banana-jacqu...,Medium,3.5,Pastel Green,"coimbatore ,tamil nadu"
...,...,...,...,...,...,...,...,...,...,...,...
76,OtherWise,6800.0,6800.0,0.000000,banana fiber and linen sleeve shirt,1,https://www.otherwise.shop/products/organic-ba...,Good,4.0,white,NaN
77,Soma Blockprints Private Limited,4144.0,4144.0,0.000000,banana fiber kurta,1,https://somashop.com/product/rose-2-kurta-2807...,Medium,3.7,pink,"Rajasthan, India"
78,Soma Blockprints Private Limited,3651.0,3651.0,0.000000,banana fiber cons 10 kurta,1,https://somashop.com/product/cons-10-kurta-2747d,Medium,3.6,Multi,"Rajasthan, India"
79,Lazzari stores,63877.0,127755.0,50.000391,banana fabric white dress,1,https://www.lazzariweb.it/en/casey-casey-natur...,Good,4.0,white,"Triveso ,Italy"
80,Tilly Groups Thuruthel and Solution,850.0,850.0,0.000000,banana woven fabric(meter),1,https://www.dial4trade.com/tilly-groups-thurut...,Good,4.2,white,"Ernakulam, Kerala"

In [20]:
df.head()

,company Name,Amount,Old Price,offer %,product type,Pack_Units,product link,rating status,ratings,color,location
0,doctor towels,1299.0,1599.0,18.761726,Banana Double Cloth Bath Towels,1,https://doctortowels.com/products/banana-doubl...,Good,4.5,Golden Ochre,"coimbatore ,tamil nadu"
1,doctor towels,1399.0,1599.0,12.507817,Banana Jacquard Floral Bath Towel,1,https://doctortowels.com/products/buy-banana-j...,Good,4.5,Coral,"coimbatore ,tamil nadu"
2,doctor towels,989.0,1099.0,10.009099,Banana Jacquard Floral Hand Towel,2,https://doctortowels.com/products/banana-jacqu...,Medium,3.0,Chalk Blue,"coimbatore ,tamil nadu"
3,doctor towels,989.0,1099.0,10.009099,Banana Jacquard Floral Face Towel,4,https://doctortowels.com/products/banana-jacqu...,Medium,3.0,Pastel Green,"coimbatore ,tamil nadu"
4,doctor towels,599.0,849.0,29.446408,Banana Jacquard Floral Hair Towel,1,https://doctortowels.com/products/banana-jacqu...,Medium,3.5,Pastel Green,"coimbatore ,tamil nadu"

### info

In [21]:
#checking info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81 entries, 0 to 80
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   company Name   81 non-null     object
 1   Amount         80 non-null     float64
 2   Old Price      80 non-null     float64
 3    offer %       80 non-null     float64
 4   product type   81 non-null     object
 5   Pack_Units     81 non-null     int64
 6   product link   81 non-null     object
 7   rating status  81 non-null     object
 8   ratings        81 non-null     float64
 9   color          74 non-null     object
 10  location       62 non-null     object
dtypes: float64(4), int64(1), object(6)
memory usage: 7.1+ KB

### checking for Null values

In [22]:
# checking for Null valuesa
df.isnull().sum()

company Name      0
Amount            1
Old Price         1
 offer %          1
product type      0
Pack_Units        0
product link      0
rating status     0
ratings           0
color             7
location         19
dtype: int64

In [23]:
#removing the null values
df.dropna(inplace=True)

In [24]:
# checking for duplicated values 
df.duplicated().sum()

0

In [25]:
##checking datatypes
df.dtypes

company Name      object
Amount           float64
Old Price        float64
 offer %         float64
product type      object
Pack_Units         int64
product link      object
rating status     object
ratings          float64
color             object
location          object
dtype: object

### Dropping the unwanted columns

In [26]:
df.drop({'product link','location'},axis=1,inplace=True)
df.head()

,company Name,Amount,Old Price,offer %,product type,Pack_Units,rating status,ratings,color
0,doctor towels,1299.0,1599.0,18.761726,Banana Double Cloth Bath Towels,1,Good,4.5,Golden Ochre
1,doctor towels,1399.0,1599.0,12.507817,Banana Jacquard Floral Bath Towel,1,Good,4.5,Coral
2,doctor towels,989.0,1099.0,10.009099,Banana Jacquard Floral Hand Towel,2,Medium,3.0,Chalk Blue
3,doctor towels,989.0,1099.0,10.009099,Banana Jacquard Floral Face Towel,4,Medium,3.0,Pastel Green
4,doctor towels,599.0,849.0,29.446408,Banana Jacquard Floral Hair Towel,1,Medium,3.5,Pastel Green

In [27]:
# chaning the columns names into lowercase
df.columns

Index(['company Name', 'Amount ', 'Old Price', ' offer % ', 'product type ',
       'Pack_Units', 'rating status', 'ratings', 'color'],
      dtype='object')

In [28]:
df.columns = [i.lower() for i in df.columns]

In [29]:
df.columns

Index(['company name', 'amount ', 'old price', ' offer % ', 'product type ',
       'pack_units', 'rating status', 'ratings', 'color'],
      dtype='object')

### statistical analysis

In [30]:
df.describe()

            amount       old price   offer %   pack_units    ratings
count     57.000000      57.000000  57.000000   57.000000  57.000000
mean    3885.368421    5340.456140   9.281575    2.842105   3.817544
std     9169.381459   17095.714409  14.602020   13.106418   0.390569
min      130.000000     130.000000   0.000000    1.000000   2.900000
25%      989.000000    1050.000000   0.000000    1.000000   3.500000
50%     1800.000000    1800.000000   0.000000    1.000000   3.900000
75%     2890.000000    3651.000000  14.285714    1.000000   4.000000
max    63877.000000  127755.000000  60.000000  100.000000   4.800000

In [31]:
df.describe(include="O")

         company name      product type  rating status  color
count              57                 57            57     57
unique             42                 43             3     28
top     doctor towels  banana silk saree        Medium  white
freq                6                  6            32     13

## Features Selection Process

In [36]:
df.select_dtypes(include="object").head(3)

,company name,product type,rating status,color
0,doctor towels,Banana Double Cloth Bath Towels,Good,Golden Ochre
1,doctor towels,Banana Jacquard Floral Bath Towel,Good,Coral
2,doctor towels,Banana Jacquard Floral Hand Towel,Medium,Chalk Blue

In [41]:
df['company name'].nunique(),df['company name'].unique()

(42,
 array(['doctor  towels', 'doctor towels', 'STUDIO-N',
        'Lush Textiles Private Limited',
        'Hayael Aerospace India Private Limited', 'J. C Overseas Inc.',
        'sepiastories', 'Brown living', 'M/S Bar Organic Enterprise',
        'conifer ', 'Shree JiExports', 'Star Silk Exports Pvt Ltd',
        'Raydan', 'Musa AGRO industries pvt ltd', 'champs Agro Unit',
        'Asian fabric mills', 'Green Fibre', 'Deearna Exports',
        'Paharat fashion LLP', 'Ikiru', 'Sindinga9', 'Napas Handlooms',
        'Chettinad Thari', 'Very Much India', 'the kina', 'Banana Fibers',
        'My Clothing Treasure ', 'Uppada', 'Prashanti saree',
        'Sriram Textile', 'JothiMathi Textile', 'Nilambari ', '9yardz',
        'Vannamayil fashions', 'Sri Lakshmi Stores', "Sruthi's fashion",
        'Kosigam', 'Ora Organic India', 'Game Changer Texfab pvt ltd',
        'Soma Blockprints Private Limited ', 'Lazzari stores',
        'Tilly Groups Thuruthel and Solution'], dtype=object))

In [42]:
df['company name'] =df['company name'].replace('doctor  towels','doctor towels')

In [43]:
df['company name'].nunique()

41

In [44]:
df['color'].nunique(),df['color'].unique()

(28,
 array(['Golden Ochre', 'Coral', 'Chalk Blue', 'Pastel Green',
        'French Blue', 'plain orange', 'Black', 'plain ', 'plain', 'white',
        'Beige & Grey', ' Multi', 'green', 'Red', 'pink', 'light yellow',
        'Multi', 'French Blue & Golden Ochre', 'Charcoal', 'beach',
        'Pink chambray', 'dark green', 'Saddle Brown', 'dark brown',
        'dark blue', 'navy blue', 'brown', 'Rust Brown'], dtype=object))

In [45]:
df['color'] =df['color'].replace('plain ','plain')

In [46]:
df['color'].nunique()

27

In [39]:
df['product type '].nunique()

43

In [40]:
df['rating status'].nunique()

3

In [ ]:
#df_categorical_col = {df.columns=['c']}